#Лесникова Екатерина, 21ИС21, 14.11.22
#Задание 1. If1. Дано целое число. Если оно является положительным, то вычесть из него 8; в противном случае не изменять его. Вывести полученное число. 
a=int(input())
if a>0:
    print (a-8)
